JiaEnChua/Handi_glove_software/STM32l152zet6_UART_Receiver/Src/main.c

/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  ** This notice applies to any and all portions of this file
  * that are not between comment pairs USER CODE BEGIN and
  * USER CODE END. Other portions of this file, whether 
  * inserted by the user or by software development tools
  * are owned by their respective copyright owners.
  *
  * COPYRIGHT(c) 2018 STMicroelectronics
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32l1xx_hal.h"

/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc;
DMA_HandleTypeDef hdma_adc;

TIM_HandleTypeDef htim2;
TIM_HandleTypeDef htim3;
TIM_HandleTypeDef htim4;
TIM_HandleTypeDef htim5;
TIM_HandleTypeDef htim7;
TIM_HandleTypeDef htim10;

UART_HandleTypeDef huart3;
DMA_HandleTypeDef hdma_usart3_rx;

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/
#include "stm32l152c_discovery.h"

#define servoInit	2
static GPIO_InitTypeDef GPIO_InitStruct;

int receivedValue=0;
int adcValue=0;
int prev=0;
int count=0;
uint32_t adc[10], prevADC[5];
uint32_t curstep[5], expectedStep[5];
uint32_t sensor[6];
uint32_t servo[5], spiData[5];
long int k=0;
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_TIM2_Init(void);
static void MX_TIM3_Init(void);
static void MX_TIM10_Init(void);
static void MX_ADC_Init(void);
static void MX_TIM7_Init(void);
static void MX_USART3_UART_Init(void);
static void MX_TIM4_Init(void);
static void MX_TIM5_Init(void);
                                    
void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);
                                
                                
                                
                                

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/

/* USER CODE END PFP */

/* USER CODE BEGIN 0 */
void setupLED()
{
  LED3_GPIO_CLK_ENABLE();

  /*Configure GPIO pin : LED_3_Pin */
  GPIO_InitStruct.Pin = LED3_PIN;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(LED3_GPIO_PORT, &GPIO_InitStruct);

  /*Configure GPIO pin : LED_4_Pin */
  LED4_GPIO_CLK_ENABLE();

  GPIO_InitStruct.Pin = LED4_PIN;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(LED4_GPIO_PORT, &GPIO_InitStruct);


  GPIO_InitStruct.Pin = GPIO_PIN_8;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);
}
void setupPressureFB()
{
  // PB5,6, PE2,5, PF0~5
  /* GPIOx Periph clock enable */
  RCC->AHBENR |= RCC_AHBENR_GPIOBEN | RCC_AHBENR_GPIOEEN | RCC_AHBENR_GPIOFEN;
  /* Configure Pxx in output  mode  */
  GPIOB->MODER |= (GPIO_MODER_MODER5_0 | GPIO_MODER_MODER6_0);
  GPIOE->MODER |= (GPIO_MODER_MODER2_0 | GPIO_MODER_MODER5_0);
  GPIOF->MODER |= (GPIO_MODER_MODER0_0 | GPIO_MODER_MODER1_0 | GPIO_MODER_MODER2_0 | GPIO_MODER_MODER3_0 | GPIO_MODER_MODER4_0 | GPIO_MODER_MODER5_0);
  // Ensure push pull mode selected--default
  GPIOB->OTYPER &= ~(GPIO_OTYPER_OT_5 | GPIO_OTYPER_OT_6);
  GPIOE->OTYPER &= ~(GPIO_OTYPER_OT_2 | GPIO_OTYPER_OT_5);
  GPIOF->OTYPER &= ~(GPIO_OTYPER_OT_0 | GPIO_OTYPER_OT_1 | GPIO_OTYPER_OT_2 | GPIO_OTYPER_OT_3 | GPIO_OTYPER_OT_4 | GPIO_OTYPER_OT_5);
  //Ensure all pull up pull down resistors are disabled
  GPIOB->PUPDR &= ~(GPIO_PUPDR_PUPDR5|GPIO_PUPDR_PUPDR6);
  GPIOE->PUPDR &= ~(GPIO_PUPDR_PUPDR2|GPIO_PUPDR_PUPDR5);
  GPIOF->PUPDR &= ~(GPIO_PUPDR_PUPDR0|GPIO_PUPDR_PUPDR1|GPIO_PUPDR_PUPDR2|GPIO_PUPDR_PUPDR3|GPIO_PUPDR_PUPDR4|GPIO_PUPDR_PUPDR5);
}
void forward0() {
	HAL_GPIO_WritePin(GPIOB, GPIO_PIN_5, GPIO_PIN_RESET);
	HAL_GPIO_WritePin(GPIOB, GPIO_PIN_6, GPIO_PIN_SET);
}
void backward0() {
	HAL_GPIO_WritePin(GPIOB, GPIO_PIN_5, GPIO_PIN_SET);
	HAL_GPIO_WritePin(GPIOB, GPIO_PIN_6, GPIO_PIN_RESET);
}
void stop0() {
	HAL_GPIO_WritePin(GPIOB, GPIO_PIN_5, GPIO_PIN_RESET);
	HAL_GPIO_WritePin(GPIOB, GPIO_PIN_6, GPIO_PIN_RESET);
}
void forward1() {
	HAL_GPIO_WritePin(GPIOE, GPIO_PIN_2, GPIO_PIN_RESET);
	HAL_GPIO_WritePin(GPIOE, GPIO_PIN_5, GPIO_PIN_SET);
}
void backward1() {
	HAL_GPIO_WritePin(GPIOE, GPIO_PIN_2, GPIO_PIN_SET);
	HAL_GPIO_WritePin(GPIOE, GPIO_PIN_5, GPIO_PIN_RESET);
}
void stop1() {
	HAL_GPIO_WritePin(GPIOE, GPIO_PIN_2, GPIO_PIN_RESET);
	HAL_GPIO_WritePin(GPIOE, GPIO_PIN_5, GPIO_PIN_RESET);
}
void forward2() {
	HAL_GPIO_WritePin(GPIOF, GPIO_PIN_0, GPIO_PIN_RESET);
	HAL_GPIO_WritePin(GPIOF, GPIO_PIN_1, GPIO_PIN_SET);
}
void backward2() {
	HAL_GPIO_WritePin(GPIOF, GPIO_PIN_0, GPIO_PIN_SET);
	HAL_GPIO_WritePin(GPIOF, GPIO_PIN_1, GPIO_PIN_RESET);
}
void stop2() {
	HAL_GPIO_WritePin(GPIOF, GPIO_PIN_0, GPIO_PIN_RESET);
	HAL_GPIO_WritePin(GPIOF, GPIO_PIN_1, GPIO_PIN_RESET);
}
void forward3() {
	HAL_GPIO_WritePin(GPIOF, GPIO_PIN_2, GPIO_PIN_RESET);
	HAL_GPIO_WritePin(GPIOF, GPIO_PIN_3, GPIO_PIN_SET);
}
void backward3() {
	HAL_GPIO_WritePin(GPIOF, GPIO_PIN_2, GPIO_PIN_SET);
	HAL_GPIO_WritePin(GPIOF, GPIO_PIN_3, GPIO_PIN_RESET);
}
void stop3() {
	HAL_GPIO_WritePin(GPIOF, GPIO_PIN_2, GPIO_PIN_RESET);
	HAL_GPIO_WritePin(GPIOF, GPIO_PIN_3, GPIO_PIN_RESET);
}
void forward4() {
	HAL_GPIO_WritePin(GPIOF, GPIO_PIN_4, GPIO_PIN_RESET);
	HAL_GPIO_WritePin(GPIOF, GPIO_PIN_5, GPIO_PIN_SET);
}
void backward4() {
	HAL_GPIO_WritePin(GPIOF, GPIO_PIN_4, GPIO_PIN_SET);
	HAL_GPIO_WritePin(GPIOF, GPIO_PIN_5, GPIO_PIN_RESET);
}
void stop4() {
	HAL_GPIO_WritePin(GPIOF, GPIO_PIN_4, GPIO_PIN_RESET);
	HAL_GPIO_WritePin(GPIOF, GPIO_PIN_5, GPIO_PIN_RESET);
}
void resetLA(int time) {
	backward0();
	backward1();
	backward2();
	backward3();
	backward4();
	for(k=0;k<time;k++) {}
	stop0();
	stop1();
	stop2();
	stop3();
	stop4();
}
void turnLA()
{
	if(adc[0] > 2000) {
		expectedStep[0] = (4200 - adc[0]) / 400;
		if(curstep[0] < expectedStep[0]) {
			forward0();
			curstep[0] += 1;
		} else if(curstep[0] > expectedStep[0]) {
			backward0();
			curstep[0] -= 1;
		} else {
			stop0();
		}
		prevADC[0] = adc[0];
	}
	if(adc[1] > 2000) {
		expectedStep[1] = (4200 - adc[1]) / 400;
		if(curstep[1] < expectedStep[1]) {
			forward1();
			curstep[1] += 1;
		} else if(curstep[1] > expectedStep[1]) {
			backward1();
			curstep[1] -= 1;
		} else {
			stop1();
		}
		prevADC[1] = adc[1];
	}
	if(adc[2] > 2000) {
		expectedStep[2] = (4200 - adc[2]) / 400;
		if(curstep[2] < expectedStep[2]) {
			forward2();
			curstep[2] += 1;
		} else if(curstep[2] > expectedStep[2]) {
			backward2();
			curstep[2] -= 1;
		} else {
			stop2();
		}
		prevADC[2] = adc[2];
	}
	if(adc[3] > 2000) {
		expectedStep[3] = (4200 - adc[3]) / 400;
		if(curstep[3] < expectedStep[3]) {
			forward3();
			curstep[3] += 1;
		} else if(curstep[3] > expectedStep[3]) {
			backward3();
			curstep[3] -= 1;
		} else {
			stop3();
		}
		prevADC[3] = adc[3];
	}
	if(adc[4] > 2000) {
		expectedStep[4] = (4200 - adc[4]) / 400;
		if(curstep[4] < expectedStep[4]) {
			forward4();
			curstep[4] += 1;
		} else if(curstep[4] > expectedStep[4]) {
			backward4();
			curstep[4] -= 1;
		} else {
			stop4();
		}
		prevADC[4] = adc[4];
	}
}
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
	if(htim->Instance == TIM2) {
	} else if(htim->Instance == TIM3) {
		turnLA();
	} else if(htim->Instance == TIM7) {
//		if(sensor[5] <= 4000) {
//			servo[0] = sensor[0];
//			servo[1] = sensor[1];
//			servo[2] = sensor[2];
//			servo[3] = sensor[3];
//			servo[4] = sensor[4];
//			HAL_UART_Transmit(&huart3, servo, sizeof(servo), 100);
//		} else {
//			spiData[0] = 3300;
//			spiData[1] = 3300;
//			spiData[2] = 3300;
//			spiData[3] = 3300;
//			spiData[4] = 3300;
//			HAL_UART_Transmit(&huart3, spiData, sizeof(spiData), 100);
//		}
		//3500 ~ 3143
		//2300 ~ 1300
		//3695 ~ 2660
		//4037 ~ 2807
		//3600 ~ 1900
		servo[0] = sensor[0];
		servo[1] = sensor[1];
		servo[2] = sensor[2];
		servo[3] = sensor[3];
		servo[4] = sensor[4];
		HAL_UART_Transmit(&huart3, servo, sizeof(servo), 100);
	} else if(htim->Instance == TIM10) {
		if(adc[0] > 4000 && prevADC[0] > 4000) {
			backward0();
		}
		if(adc[1] > 4000 && prevADC[1] > 4000) {
			backward1();
		}
		if(adc[2] > 4000 && prevADC[2] > 4000) {
			backward2();
		}
		if(adc[3] > 4000 && prevADC[3] > 4000) {
			backward3();
		}
		if(adc[4] > 4000 && prevADC[4] > 4000) {
			backward4();
		}
		for(int i=0;i<300000;i++) {}
		stop0();
		stop1();
		stop2();
		stop3();
		stop4();
	}
}
void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart)
{
	// Pressure Sensor
	// ADCDMA: 1600 ~ 2200
	// ADCPoll: 2600 ~ 4200
}
void HAL_UART_RxHalfCpltCallback(UART_HandleTypeDef *huart)
{
}
void HAL_ADC_ConvCpltCallback(ADC_HandleTypeDef* hadc)
{
}
/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  *
  * @retval None
  */
int main(void)
{
  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

